Tekla.Structures.ModelInternal.PluginData
The plugin data IFC export is using for export.

Tekla.Structures.ModelInternal.PluginData.ExportAssemblies


Tekla.Structures.ModelInternal.PluginData.ExportIncludeAssemblyHierarchy


Tekla.Structures.ModelInternal.PluginData.ExportReinforcingBars


Tekla.Structures.ModelInternal.PluginData.ExportBolts


Tekla.Structures.ModelInternal.PluginData.CreateFromAll


Tekla.Structures.ModelInternal.PluginData.CreateFromSelectedObjectsAndTheirAssemblies


Tekla.Structures.ModelInternal.PluginData.SelectedExportType


Tekla.Structures.ModelInternal.PluginData.ExportFormat


Tekla.Structures.ModelInternal.PluginData.ExportGrids


Tekla.Structures.ModelInternal.PluginData.ExportPourObjects


Tekla.Structures.ModelInternal.PluginData.ExportWelds


Tekla.Structures.ModelInternal.PluginData.ExportLayersNameAsPart


Tekla.Structures.ModelInternal.PluginData.ExportSurfaceTreatments


Tekla.Structures.ModelInternal.PluginData.ExcludeSinglePartAssemblies


Tekla.Structures.ModelInternal.PluginData.LocationsFromOrganizer


Tekla.Structures.ModelInternal.PluginData.NameOfBasePoint


Tekla.Structures.ModelInternal.PluginData.LocationByIndex


Tekla.Structures.ModelInternal.PluginData.ExportFlatBeamsAsPlates


Tekla.Structures.ModelInternal.PluginData.UseViewColors


Tekla.Structures.ModelInternal.PluginData.PolyBeamAsSectionedSpine


Tekla.Structures.ModelInternal.PluginData.OutputFileName


Tekla.Structures.ModelInternal.PluginData.AdditionalPropertySetFileName


Tekla.Structures.ModelInternal.PluginData.PropertySetContentContent


Tekla.Structures.ModelInternal.PluginData.ExportBuildingHierarchy


Tekla.Structures.ModelInternal.PluginData.ExportBrepAsExactSolid


Tekla.Structures.ModelInternal.PluginData.ExportSpaces


Tekla.Structures.ModelInternal.PluginData.ExportAttributeOverrideSetDataFile


Tekla.Structures.ModelInternal.PluginData.ExportAttributeOverrideDataFile


Tekla.Structures.ModelInternal.PluginData.FilterName
